#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-TYU1QMxaiMzNbVNg

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_object.object["0"]: Refreshing state... [id=images/favicon.png]
aws_s3_object.files["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]
aws_s3_object.files["index.html"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.files["asset-manifest.json"] will be created
  + resource "aws_s3_object" "files" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "5cd08cdaf3d44c8ba429d7a15d5a6db0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/asset-manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.files["favicon.ico"] will be created
  + resource "aws_s3_object" "files" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "c92b85a5b907c70211f4ec25e29a8c4a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "files" {
      ~ etag                   = "49950a553e80f5a9da73b3c85939fff2" -> "382292a85fd01c6ac3c74b3638fd59f4"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.files["logo192.png"] will be created
  + resource "aws_s3_object" "files" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "33dbdd0177549353eeeb785d02c294af"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "logo192.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/logo192.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.files["logo512.png"] will be created
  + resource "aws_s3_object" "files" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "917515db74ea8d1aee6a246cfbcc0b45"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "logo512.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/logo512.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.files["manifest.json"] will be created
  + resource "aws_s3_object" "files" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "d9d975cebe2ec20b6c652e1e4c12ccf0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.files["robots.txt"] will be created
  + resource "aws_s3_object" "files" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "fa1ded1ed7c11438a9b0385b1e112850"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/robots.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.object["0"] will be destroyed
  # (because key ["0"] is not in for_each map)
  - resource "aws_s3_object" "object" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/html" -> null
      - etag                   = "c7162f62f53cb9a279ccdfce9bebb086" -> null
      - force_destroy          = false -> null
      - id                     = "images/favicon.png" -> null
      - key                    = "images/favicon.png" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "src/images/favicon.png" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

Plan: 6 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*